Repository: DoroteyaTodorova/AprilWork
Catalog: HitachiSPACEProgramme/HitachiSPACEProgramme/Languages/*.language.resx
Languages: de

# AcceptableClouds
source: Acceptable Cloud Types:
de: Akzeptable Wolkenarten:

# AcceptableCloudTypesSuccess
source: Acceptable cloud types changed successfully.
de: Akzeptable Wolkenarten erfolgreich geändert.

source: Accept Lightnings:
de: Blitze akzeptieren:

# AcceptLightningsPrompt
source: Accept lightnings? (Yes/No):
de: Akzeptieren Sie Blitze? (Ja/Nein):

# AcceptLightningsSetNo
source: Accept lightnings set to No.
de: Blitz akzeptieren auf Nein gesetzt.

# AcceptLightningsSetYes
source: Accept lightnings set to Yes.
de: Blitz akzeptieren auf Ja gesetzt.

# BestSpaceport_Message
source: Best Spaceport: {0}, Day: {1}
de: Bester Raumhafen: {0}, Tag: {1}

# ChangeCriteriaPrompt
source: Enter the number of the criteria you want to change or 0 if you dont want to make changes:
de: Geben Sie die Nummer des Kriteriums ein, das Sie ändern möchten, oder 0, wenn Sie keine Änderungen vornehmen möchten:

# ChooseEmailProvider
source: Choose your email service provider: (If you choose Gmail get your app password)
de: Wählen Sie Ihren E-Mail-Dienstanbieter: (Wenn Sie Gmail wählen, erhalten Sie Ihr App-Passwort)

# CloudTypesChanged
source: Acceptable cloud types changed successfully.
de: Akzeptable Wolkenarten erfolgreich geändert.

# CloudTypesPrompt
source: Enter the acceptable cloud types (comma-separated):
de: Geben Sie die akzeptablen Wolkenarten ein (durch Komma getrennt):

# CriteriaFile_Checking
source: Checking file: {0}
de: Überprüfe Datei: {0}

# CriteriaFile_EnterCriteria
source: Enter criteria for file: {0}
de: Geben Sie die Kriterien für die Datei ein: {0}

# CriteriaFile_Prompt
source: Do you want to change criteria for file [Yes/No]: {0}
de: Möchten Sie die Kriterien für die Datei ändern [Ja/Nein]: {0}

# Criteria_ContinueOption
source: No, continue with current criteria
de: Nein, fahren Sie mit den aktuellen Kriterien fort

# Criteria_ModifyFileOption
source: Yes, I want to modify a criteria for specific file
de: Ja, ich möchte Kriterien für eine bestimmte Datei ändern

# Criteria_ModifyPrompt
source: Do you want to modify any criteria?[1/2/3/4]
de: Möchten Sie Kriterien ändern?[1/2/3/4]

# Criteria_NoOption
source: No, show current criteria
de: Nein, aktuelle Kriterien anzeigen

# Criteria_YesOption
source: Yes, modify criteria
de: Ja, Kriterien ändern

# CurrentCriteria
source: Current criteria values:
de: Aktuelle Kriterienwerte:

# EmailFailed
source: Failed to send email. Error message: {0}
de: Senden der E-Mail fehlgeschlagen. Fehlermeldung: {0}

# EmailSent
source: Email sent successfully.
de: E-Mail erfolgreich gesendet.

# EnterChoice
source: Enter your choice:
de: Geben Sie Ihre Auswahl ein:

# EnterReceiverEmail
source: Enter receiver's email address:
de: E-Mail-Adresse des Empfängers eingeben:

# EnterSenderEmail
source: Enter sender's email address:
de: E-Mail-Adresse des Absenders eingeben:

# EnterSenderPassword
source: Enter sender's password:
de: Passwort des Absenders eingeben:

# ErrorWritingReport
source: Error writing launch analysis report: {0}
de: Fehler beim Schreiben des Startanalysenberichts: {0}

# FolderNotExist
source: Specified folder does not exist.
de: Angegebener Ordner existiert nicht.

# FolderPath_Error
source: The specified folder does not exist.
de: Der angegebene Ordner existiert nicht.

# FolderPath_Prompt
source: Enter the folder path containing weather forecasts:
de: Geben Sie den Ordnerpfad mit den Wettervorhersagen ein:

# FolderPath_Selected
source: Selected folder: {0}
de: Ausgewählter Ordner: {0}

# FolderPath_UnexpectedError
source: An unexpected error occurred:
de: Ein unerwarteter Fehler ist aufgetreten:

# Introduction
source: Hello! You are about to create and send a Launch Analysis Report. To proceed successfully, you will need .csv files. Please ensure that each file is named after the location it represents, for example: Kourou.csv. It's important to note that the analysis will not work unless we have all files in the correct format! If you're ready, we can proceed.
de: Hallo! Sie sind dabei, einen Launch-Analysebericht zu erstellen und zu versenden. Um erfolgreich fortzufahren, benötigen Sie CSV-Dateien. Bitte stellen Sie sicher, dass jede Datei nach dem Speicherort benannt ist, den sie repräsentiert, zum Beispiel: Kourou.csv. Es ist wichtig zu beachten, dass die Analyse nur dann funktioniert, wenn wir alle Dateien im richtigen Format haben! Wenn Sie bereit sind, können wir fortfahren.

# InvalidCloudType
source: Invalid cloud type: {0}. Please enter one of the following: Cumulus, Stratus, Nimbus, Cirrus.
de: Ungültige Wolkenart: {0}. Bitte geben Sie eine der folgenden ein: Cumulus, Stratus, Nimbus, Cirrus.

# InvalidDataCloudType
source: Invalid cloud type {0} on Day {1}. Please provide one of the following: Cirrus, Stratus, Cumulus, Nimbus.
de: Ungültiger Wolkentyp {0} für Tag {1}. Bitte geben Sie einen der folgenden Wolkentypen an: Cirrus, Stratus, Cumulus, Nimbus.

# InvalidDataFormatErrorMessage
source: Error: Invalid data format in the file. {0}
de: Fehler: Ungültiges Datenformat in der Datei. {0}

# InvalidDataFormatForDay
source: Invalid data format for Day {0}. Please provide data for all 16 parameters.
de: Ungültiges Datenformat für den Tag {0}. Bitte geben Sie Daten für alle 16 Parameter an.

# InvalidDataFormatForDayParameter
source: Invalid data format for Parameter {0}, Day {1}. Please provide a valid integer.
de: Ungültiges Datenformat für Parameter {0}, Tag {1}. Bitte geben Sie eine gültige Ganzzahl an.

# InvalidDataFormatForLightning
source: Invalid data format for Lightning on Day {0}. Please provide 'Yes' or 'No'.
de: Ungültiges Datenformat für Blitz am Tag {0}. Bitte geben Sie 'Yes' oder 'No' an.

# InvalidDataFormatForTemperature
source: Invalid data format for Temperature on Day {0}. Please provide a valid integer.
de: Ungültiges Datenformat für die Temperatur am Tag {0}. Bitte geben Sie eine gültige Ganzzahl an.

# InvalidEmail
source: Invalid email address. Please enter a valid email address.
de: Ungültige E-Mail-Adresse. Bitte geben Sie eine gültige E-Mail-Adresse ein.

# InvalidInput
source: Invalid input. Please enter a valid number.
de: Ungültige Eingabe. Bitte geben Sie eine gültige Nummer ein.

# InvalidLightningsInput
source: Invalid input. Please enter 'Yes' or 'No'.
de: Ungültige Eingabe. Bitte geben Sie 'Ja' oder 'Nein' ein.

# InvalidNumberOfLines
source: Invalid number of lines in the file. Please provide a file with exactly 7 lines.
de: Ungültige Anzahl von Zeilen in der Datei. Bitte geben Sie eine Datei mit genau 7 Zeilen an.

# InvalidPassword
source: Invalid password. Please enter a valid password.
de: Ungültiges Passwort. Bitte geben Sie ein gültiges Passwort ein.

# Language_Prompt
source: Please select the language you want to continue with (EN or DE)
de: Bitte geben Sie die Sprache ein, mit der Sie fortfahren möchten (EN oder DE)

source: Max Humidity:
de: Maximale Luftfeuchtigkeit:

# MaxHumidityPrompt
source: Enter the new value for Max Humidity:
de: Geben Sie den neuen Wert für die maximale Luftfeuchtigkeit ein:

# MaxHumiditySuccess
source: Max Humidity changed successfully.
de: Max Luftfeuchtigkeit erfolgreich geändert.

source: Max Precipitation:
de: Maximale Niederschlagswahrscheinlichkeit:

# MaxPrecipitationPrompt
source: Enter the new value for Max Precipitation:
de: Geben Sie den neuen Wert für die maximale Niederschlagswahrscheinlichkeit ein:

# MaxPrecipitationSuccess
source: Max Precipitation changed successfully.
de: Max Niederschlag erfolgreich geändert.

source: Max Temperature:
de: Höchsttemperatur:

# MaxTemperaturePrompt
source: Enter the new value for Max Temperature:
de: Geben Sie den neuen Wert für die Höchsttemperatur ein:

# MaxTemperatureSuccess
source: Max Temperature changed successfully.
de: Die maximale Temperatur wurde erfolgreich geändert.

source: Max Wind:
de: Maximale Windgeschwindigkeit:

# MaxWindPrompt
source: Enter the new value for Max Wind:
de: Geben Sie den neuen Wert für die maximale Windgeschwindigkeit ein:

# MaxWindSuccess
source: Max Wind changed successfully.
de: Der Wert für die maximale Windgeschwindigkeit wurde erfolgreich geändert.

source: Min Temperature:
de: Mindesttemperatur:

# MinTemperaturePrompt
source: Enter the new value for Min Temperature:
de: Geben Sie den neuen Wert für die Mindesttemperatur ein:

# MinTemperatureSuccess
source: Min Temperature changed successfully.
de: Die Mindesttemperatur wurde erfolgreich geändert.

# NewValue
source: Enter the new value for
de: Geben Sie den neuen Wert für

source: no
de: nein

# NoChangesMade
source: No Changes were made.
de: Es wurden keine Änderungen vorgenommen.

# NoCSVFiles
source: The selected folder does not contain any .csv files.
de: Der ausgewählte Ordner enthält keine .csv-Dateien.

# Password
source: Password is required.
de: Passwort erforderlich.

# ReceiverEmail
source: Receiver's email address is required.
de: E-Mail-Adresse des Empfängers erforderlich.

# ReportCreatedSuccessfully
source: Launch analysis report created successfully at: {0}
de: Startanalysenbericht erfolgreich erstellt unter: {0}

# SenderEmail
source: Sender's email address is required.
de: E-Mail-Adresse des Absenders erforderlich.

# SMTPSelection
source: SMTP server selection is required.
de: Auswahl des SMTP-Servers erforderlich.

# UnexpectedErrorGetFolder
source: An unexpected error occurred while getting folder and CSV files: {0}
de: Ein unerwarteter Fehler ist beim Abrufen des Ordners und der CSV-Dateien aufgetreten: {0}

# UnexpectedErrorMessage
source: An unexpected error occurred: {0}
de: Ein unerwarteter Fehler ist aufgetreten: {0}

# UnknownSpaceport
source: Unknown spaceport: {0}. Cannot calculate distance.
de: Unbekannter Raumhafen: {0}. Entfernung kann nicht berechnet werden.

# WeatherCheck_Error
source: An error occurred while checking weather conditions. Please enter another file path.
de: Beim Überprüfen der Wetterbedingungen ist ein Fehler aufgetreten. Bitte geben Sie einen anderen Dateipfad ein.

source: yes
de: ja
